dinguluer/Renesas_FreeRTOS/RL78/CCRL/R5F10BMG/No bank register concept used/test/iodefine.h
#define RPGACC38H    (*(volatile __near unsigned char  *)0x5CD)
#define RPGACC39     (*(volatile __near unsigned short *)0x5CE)
#define RPGACC39L    (*(volatile __near unsigned char  *)0x5CE)
#define RPGACC39H    (*(volatile __near unsigned char  *)0x5CF)
#define RPGACC40     (*(volatile __near unsigned short *)0x5D0)
#define RPGACC40L    (*(volatile __near unsigned char  *)0x5D0)
#define RPGACC40H    (*(volatile __near unsigned char  *)0x5D1)
#define RPGACC41     (*(volatile __near unsigned short *)0x5D2)
#define RPGACC41L    (*(volatile __near unsigned char  *)0x5D2)
#define RPGACC41H    (*(volatile __near unsigned char  *)0x5D3)
#define RPGACC42     (*(volatile __near unsigned short *)0x5D4)
#define RPGACC42L    (*(volatile __near unsigned char  *)0x5D4)
#define RPGACC42H    (*(volatile __near unsigned char  *)0x5D5)
#define RPGACC43     (*(volatile __near unsigned short *)0x5D6)
#define RPGACC43L    (*(volatile __near unsigned char  *)0x5D6)
#define RPGACC43H    (*(volatile __near unsigned char  *)0x5D7)
#define RPGACC44     (*(volatile __near unsigned short *)0x5D8)
#define RPGACC44L    (*(volatile __near unsigned char  *)0x5D8)
#define RPGACC44H    (*(volatile __near unsigned char  *)0x5D9)
#define RPGACC45     (*(volatile __near unsigned short *)0x5DA)
#define RPGACC45L    (*(volatile __near unsigned char  *)0x5DA)
#define RPGACC45H    (*(volatile __near unsigned char  *)0x5DB)
#define RPGACC46     (*(volatile __near unsigned short *)0x5DC)
#define RPGACC46L    (*(volatile __near unsigned char  *)0x5DC)
#define RPGACC46H    (*(volatile __near unsigned char  *)0x5DD)
#define RPGACC47     (*(volatile __near unsigned short *)0x5DE)
#define RPGACC47L    (*(volatile __near unsigned char  *)0x5DE)
#define RPGACC47H    (*(volatile __near unsigned char  *)0x5DF)
#define CFIDL0       (*(volatile __near unsigned short *)0x5E0)
#define RPGACC48     (*(volatile __near unsigned short *)0x5E0)
#define CFIDL0L      (*(volatile __near unsigned char  *)0x5E0)
#define RPGACC48L    (*(volatile __near unsigned char  *)0x5E0)
#define CFIDL0H      (*(volatile __near unsigned char  *)0x5E1)
#define RPGACC48H    (*(volatile __near unsigned char  *)0x5E1)
#define CFIDH0       (*(volatile __near unsigned short *)0x5E2)
#define RPGACC49     (*(volatile __near unsigned short *)0x5E2)
#define CFIDH0L      (*(volatile __near unsigned char  *)0x5E2)
#define RPGACC49L    (*(volatile __near unsigned char  *)0x5E2)
#define CFIDH0H      (*(volatile __near unsigned char  *)0x5E3)
#define RPGACC49H    (*(volatile __near unsigned char  *)0x5E3)
#define CFTS0        (*(volatile __near unsigned short *)0x5E4)
#define RPGACC50     (*(volatile __near unsigned short *)0x5E4)
#define CFTS0L       (*(volatile __near unsigned char  *)0x5E4)
#define RPGACC50L    (*(volatile __near unsigned char  *)0x5E4)
#define CFTS0H       (*(volatile __near unsigned char  *)0x5E5)
#define RPGACC50H    (*(volatile __near unsigned char  *)0x5E5)
#define CFPTR0       (*(volatile __near unsigned short *)0x5E6)
#define RPGACC51     (*(volatile __near unsigned short *)0x5E6)
#define CFPTR0L      (*(volatile __near unsigned char  *)0x5E6)
#define RPGACC51L    (*(volatile __near unsigned char  *)0x5E6)
#define CFPTR0H      (*(volatile __near unsigned char  *)0x5E7)
#define RPGACC51H    (*(volatile __near unsigned char  *)0x5E7)
#define CFDF00       (*(volatile __near unsigned short *)0x5E8)
#define RPGACC52     (*(volatile __near unsigned short *)0x5E8)
#define CFDF00L      (*(volatile __near unsigned char  *)0x5E8)
#define RPGACC52L    (*(volatile __near unsigned char  *)0x5E8)
#define CFDF00H      (*(volatile __near unsigned char  *)0x5E9)
#define RPGACC52H    (*(volatile __near unsigned char  *)0x5E9)
#define CFDF10       (*(volatile __near unsigned short *)0x5EA)
#define RPGACC53     (*(volatile __near unsigned short *)0x5EA)
#define CFDF10L      (*(volatile __near unsigned char  *)0x5EA)
#define RPGACC53L    (*(volatile __near unsigned char  *)0x5EA)
#define CFDF10H      (*(volatile __near unsigned char  *)0x5EB)
#define RPGACC53H    (*(volatile __near unsigned char  *)0x5EB)
#define CFDF20       (*(volatile __near unsigned short *)0x5EC)
#define RPGACC54     (*(volatile __near unsigned short *)0x5EC)
#define CFDF20L      (*(volatile __near unsigned char  *)0x5EC)
#define RPGACC54L    (*(volatile __near unsigned char  *)0x5EC)
#define CFDF20H      (*(volatile __near unsigned char  *)0x5ED)
#define RPGACC54H    (*(volatile __near unsigned char  *)0x5ED)
#define CFDF30       (*(volatile __near unsigned short *)0x5EE)
#define RPGACC55     (*(volatile __near unsigned short *)0x5EE)
#define CFDF30L      (*(volatile __near unsigned char  *)0x5EE)
#define RPGACC55L    (*(volatile __near unsigned char  *)0x5EE)
#define CFDF30H      (*(volatile __near unsigned char  *)0x5EF)
#define RPGACC55H    (*(volatile __near unsigned char  *)0x5EF)
#define RPGACC56     (*(volatile __near unsigned short *)0x5F0)
#define RPGACC56L    (*(volatile __near unsigned char  *)0x5F0)
#define RPGACC56H    (*(volatile __near unsigned char  *)0x5F1)
#define RPGACC57     (*(volatile __near unsigned short *)0x5F2)
#define RPGACC57L    (*(volatile __near unsigned char  *)0x5F2)
#define RPGACC57H    (*(volatile __near unsigned char  *)0x5F3)
#define RPGACC58     (*(volatile __near unsigned short *)0x5F4)
#define RPGACC58L    (*(volatile __near unsigned char  *)0x5F4)
#define RPGACC58H    (*(volatile __near unsigned char  *)0x5F5)
#define RPGACC59     (*(volatile __near unsigned short *)0x5F6)
#define RPGACC59L    (*(volatile __near unsigned char  *)0x5F6)
#define RPGACC59H    (*(volatile __near unsigned char  *)0x5F7)
#define RPGACC60     (*(volatile __near unsigned short *)0x5F8)
#define RPGACC60L    (*(volatile __near unsigned char  *)0x5F8)
#define RPGACC60H    (*(volatile __near unsigned char  *)0x5F9)
#define RPGACC61     (*(volatile __near unsigned short *)0x5FA)
#define RPGACC61L    (*(volatile __near unsigned char  *)0x5FA)
#define RPGACC61H    (*(volatile __near unsigned char  *)0x5FB)
#define RPGACC62     (*(volatile __near unsigned short *)0x5FC)
#define RPGACC62L    (*(volatile __near unsigned char  *)0x5FC)
#define RPGACC62H    (*(volatile __near unsigned char  *)0x5FD)
#define RPGACC63     (*(volatile __near unsigned short *)0x5FE)
#define RPGACC63L    (*(volatile __near unsigned char  *)0x5FE)
#define RPGACC63H    (*(volatile __near unsigned char  *)0x5FF)
#define RPGACC64     (*(volatile __near unsigned short *)0x600)
#define TMIDL0       (*(volatile __near unsigned short *)0x600)
#define RPGACC64L    (*(volatile __near unsigned char  *)0x600)
#define TMIDL0L      (*(volatile __near unsigned char  *)0x600)
#define RPGACC64H    (*(volatile __near unsigned char  *)0x601)
#define TMIDL0H      (*(volatile __near unsigned char  *)0x601)
#define RPGACC65     (*(volatile __near unsigned short *)0x602)
#define TMIDH0       (*(volatile __near unsigned short *)0x602)
#define RPGACC65L    (*(volatile __near unsigned char  *)0x602)
#define TMIDH0L      (*(volatile __near unsigned char  *)0x602)
#define RPGACC65H    (*(volatile __near unsigned char  *)0x603)
#define TMIDH0H      (*(volatile __near unsigned char  *)0x603)
#define RPGACC66     (*(volatile __near unsigned short *)0x604)
#define RPGACC66L    (*(volatile __near unsigned char  *)0x604)
#define RPGACC66H    (*(volatile __near unsigned char  *)0x605)
#define RPGACC67     (*(volatile __near unsigned short *)0x606)
#define TMPTR0       (*(volatile __near unsigned short *)0x606)
#define RPGACC67L    (*(volatile __near unsigned char  *)0x606)
#define TMPTR0L      (*(volatile __near unsigned char  *)0x606)
#define RPGACC67H    (*(volatile __near unsigned char  *)0x607)
#define TMPTR0H      (*(volatile __near unsigned char  *)0x607)
#define RPGACC68     (*(volatile __near unsigned short *)0x608)
#define TMDF00       (*(volatile __near unsigned short *)0x608)
#define RPGACC68L    (*(volatile __near unsigned char  *)0x608)
#define TMDF00L      (*(volatile __near unsigned char  *)0x608)
#define RPGACC68H    (*(volatile __near unsigned char  *)0x609)
#define TMDF00H      (*(volatile __near unsigned char  *)0x609)
#define RPGACC69     (*(volatile __near unsigned short *)0x60A)
#define TMDF10       (*(volatile __near unsigned short *)0x60A)
#define RPGACC69L    (*(volatile __near unsigned char  *)0x60A)
#define TMDF10L      (*(volatile __near unsigned char  *)0x60A)
#define RPGACC69H    (*(volatile __near unsigned char  *)0x60B)
#define TMDF10H      (*(volatile __near unsigned char  *)0x60B)
#define RPGACC70     (*(volatile __near unsigned short *)0x60C)
#define TMDF20       (*(volatile __near unsigned short *)0x60C)
#define RPGACC70L    (*(volatile __near unsigned char  *)0x60C)
#define TMDF20L      (*(volatile __near unsigned char  *)0x60C)
#define RPGACC70H    (*(volatile __near unsigned char  *)0x60D)
#define TMDF20H      (*(volatile __near unsigned char  *)0x60D)
#define RPGACC71     (*(volatile __near unsigned short *)0x60E)
#define TMDF30       (*(volatile __near unsigned short *)0x60E)
#define RPGACC71L    (*(volatile __near unsigned char  *)0x60E)
#define TMDF30L      (*(volatile __near unsigned char  *)0x60E)
#define RPGACC71H    (*(volatile __near unsigned char  *)0x60F)
#define TMDF30H      (*(volatile __near unsigned char  *)0x60F)
#define RPGACC72     (*(volatile __near unsigned short *)0x610)
#define TMIDL1       (*(volatile __near unsigned short *)0x610)
#define RPGACC72L    (*(volatile __near unsigned char  *)0x610)
#define TMIDL1L      (*(volatile __near unsigned char  *)0x610)
#define RPGACC72H    (*(volatile __near unsigned char  *)0x611)
#define TMIDL1H      (*(volatile __near unsigned char  *)0x611)
#define RPGACC73     (*(volatile __near unsigned short *)0x612)
#define TMIDH1       (*(volatile __near unsigned short *)0x612)
#define RPGACC73L    (*(volatile __near unsigned char  *)0x612)
#define TMIDH1L      (*(volatile __near unsigned char  *)0x612)
#define RPGACC73H    (*(volatile __near unsigned char  *)0x613)
#define TMIDH1H      (*(volatile __near unsigned char  *)0x613)
#define RPGACC74     (*(volatile __near unsigned short *)0x614)
#define RPGACC74L    (*(volatile __near unsigned char  *)0x614)
#define RPGACC74H    (*(volatile __near unsigned char  *)0x615)
#define RPGACC75     (*(volatile __near unsigned short *)0x616)
#define TMPTR1       (*(volatile __near unsigned short *)0x616)
#define RPGACC75L    (*(volatile __near unsigned char  *)0x616)
#define TMPTR1L      (*(volatile __near unsigned char  *)0x616)
#define RPGACC75H    (*(volatile __near unsigned char  *)0x617)
#define TMPTR1H      (*(volatile __near unsigned char  *)0x617)
#define RPGACC76     (*(volatile __near unsigned short *)0x618)
#define TMDF01       (*(volatile __near unsigned short *)0x618)
#define RPGACC76L    (*(volatile __near unsigned char  *)0x618)
#define TMDF01L      (*(volatile __near unsigned char  *)0x618)
#define RPGACC76H    (*(volatile __near unsigned char  *)0x619)
#define TMDF01H      (*(volatile __near unsigned char  *)0x619)
#define RPGACC77     (*(volatile __near unsigned short *)0x61A)
#define TMDF11       (*(volatile __near unsigned short *)0x61A)
#define RPGACC77L    (*(volatile __near unsigned char  *)0x61A)
#define TMDF11L      (*(volatile __near unsigned char  *)0x61A)
#define RPGACC77H    (*(volatile __near unsigned char  *)0x61B)
#define TMDF11H      (*(volatile __near unsigned char  *)0x61B)
#define RPGACC78     (*(volatile __near unsigned short *)0x61C)
#define TMDF21       (*(volatile __near unsigned short *)0x61C)
#define RPGACC78L    (*(volatile __near unsigned char  *)0x61C)
#define TMDF21L      (*(volatile __near unsigned char  *)0x61C)
#define RPGACC78H    (*(volatile __near unsigned char  *)0x61D)
#define TMDF21H      (*(volatile __near unsigned char  *)0x61D)
#define RPGACC79     (*(volatile __near unsigned short *)0x61E)
#define TMDF31       (*(volatile __near unsigned short *)0x61E)
#define RPGACC79L    (*(volatile __near unsigned char  *)0x61E)
#define TMDF31L      (*(volatile __near unsigned char  *)0x61E)
#define RPGACC79H    (*(volatile __near unsigned char  *)0x61F)
#define TMDF31H      (*(volatile __near unsigned char  *)0x61F)
#define RPGACC80     (*(volatile __near unsigned short *)0x620)
#define TMIDL2       (*(volatile __near unsigned short *)0x620)
#define RPGACC80L    (*(volatile __near unsigned char  *)0x620)
#define TMIDL2L      (*(volatile __near unsigned char  *)0x620)
#define RPGACC80H    (*(volatile __near unsigned char  *)0x621)
#define TMIDL2H      (*(volatile __near unsigned char  *)0x621)
#define RPGACC81     (*(volatile __near unsigned short *)0x622)
#define TMIDH2       (*(volatile __near unsigned short *)0x622)
#define RPGACC81L    (*(volatile __near unsigned char  *)0x622)
#define TMIDH2L      (*(volatile __near unsigned char  *)0x622)
#define RPGACC81H    (*(volatile __near unsigned char  *)0x623)
#define TMIDH2H      (*(volatile __near unsigned char  *)0x623)
#define RPGACC82     (*(volatile __near unsigned short *)0x624)
#define RPGACC82L    (*(volatile __near unsigned char  *)0x624)
#define RPGACC82H    (*(volatile __near unsigned char  *)0x625)
#define RPGACC83     (*(volatile __near unsigned short *)0x626)
#define TMPTR2       (*(volatile __near unsigned short *)0x626)
#define RPGACC83L    (*(volatile __near unsigned char  *)0x626)
#define TMPTR2L      (*(volatile __near unsigned char  *)0x626)
#define RPGACC83H    (*(volatile __near unsigned char  *)0x627)
#define TMPTR2H      (*(volatile __near unsigned char  *)0x627)
#define RPGACC84     (*(volatile __near unsigned short *)0x628)
#define TMDF02       (*(volatile __near unsigned short *)0x628)
#define RPGACC84L    (*(volatile __near unsigned char  *)0x628)
#define TMDF02L      (*(volatile __near unsigned char  *)0x628)
#define RPGACC84H    (*(volatile __near unsigned char  *)0x629)
#define TMDF02H      (*(volatile __near unsigned char  *)0x629)
#define RPGACC85     (*(volatile __near unsigned short *)0x62A)
#define TMDF12       (*(volatile __near unsigned short *)0x62A)
#define RPGACC85L    (*(volatile __near unsigned char  *)0x62A)
#define TMDF12L      (*(volatile __near unsigned char  *)0x62A)
#define RPGACC85H    (*(volatile __near unsigned char  *)0x62B)
#define TMDF12H      (*(volatile __near unsigned char  *)0x62B)
#define RPGACC86     (*(volatile __near unsigned short *)0x62C)
#define TMDF22       (*(volatile __near unsigned short *)0x62C)
#define RPGACC86L    (*(volatile __near unsigned char  *)0x62C)
#define TMDF22L      (*(volatile __near unsigned char  *)0x62C)
#define RPGACC86H    (*(volatile __near unsigned char  *)0x62D)
#define TMDF22H      (*(volatile __near unsigned char  *)0x62D)
#define RPGACC87     (*(volatile __near unsigned short *)0x62E)
#define TMDF32       (*(volatile __near unsigned short *)0x62E)
#define RPGACC87L    (*(volatile __near unsigned char  *)0x62E)
#define TMDF32L      (*(volatile __near unsigned char  *)0x62E)
#define RPGACC87H    (*(volatile __near unsigned char  *)0x62F)
#define TMDF32H      (*(volatile __near unsigned char  *)0x62F)
#define RPGACC88     (*(volatile __near unsigned short *)0x630)
#define TMIDL3       (*(volatile __near unsigned short *)0x630)
#define RPGACC88L    (*(volatile __near unsigned char  *)0x630)
#define TMIDL3L      (*(volatile __near unsigned char  *)0x630)
#define RPGACC88H    (*(volatile __near unsigned char  *)0x631)
#define TMIDL3H      (*(volatile __near unsigned char  *)0x631)
#define RPGACC89     (*(volatile __near unsigned short *)0x632)
#define TMIDH3       (*(volatile __near unsigned short *)0x632)
#define RPGACC89L    (*(volatile __near unsigned char  *)0x632)
#define TMIDH3L      (*(volatile __near unsigned char  *)0x632)
#define RPGACC89H    (*(volatile __near unsigned char  *)0x633)
#define TMIDH3H      (*(volatile __near unsigned char  *)0x633)
#define RPGACC90     (*(volatile __near unsigned short *)0x634)
#define RPGACC90L    (*(volatile __near unsigned char  *)0x634)
#define RPGACC90H    (*(volatile __near unsigned char  *)0x635)
#define RPGACC91     (*(volatile __near unsigned short *)0x636)
#define TMPTR3       (*(volatile __near unsigned short *)0x636)
#define RPGACC91L    (*(volatile __near unsigned char  *)0x636)
#define TMPTR3L      (*(volatile __near unsigned char  *)0x636)
#define RPGACC91H    (*(volatile __near unsigned char  *)0x637)
#define TMPTR3H      (*(volatile __near unsigned char  *)0x637)
#define RPGACC92     (*(volatile __near unsigned short *)0x638)
#define TMDF03       (*(volatile __near unsigned short *)0x638)
#define RPGACC92L    (*(volatile __near unsigned char  *)0x638)
#define TMDF03L      (*(volatile __near unsigned char  *)0x638)
#define RPGACC92H    (*(volatile __near unsigned char  *)0x639)
#define TMDF03H      (*(volatile __near unsigned char  *)0x639)
#define RPGACC93     (*(volatile __near unsigned short *)0x63A)
#define TMDF13       (*(volatile __near unsigned short *)0x63A)
#define RPGACC93L    (*(volatile __near unsigned char  *)0x63A)
#define TMDF13L      (*(volatile __near unsigned char  *)0x63A)
#define RPGACC93H    (*(volatile __near unsigned char  *)0x63B)
#define TMDF13H      (*(volatile __near unsigned char  *)0x63B)
#define RPGACC94     (*(volatile __near unsigned short *)0x63C)
#define TMDF23       (*(volatile __near unsigned short *)0x63C)
#define RPGACC94L    (*(volatile __near unsigned char  *)0x63C)
#define TMDF23L      (*(volatile __near unsigned char  *)0x63C)
#define RPGACC94H    (*(volatile __near unsigned char  *)0x63D)
#define TMDF23H      (*(volatile __near unsigned char  *)0x63D)
#define RPGACC95     (*(volatile __near unsigned short *)0x63E)
#define TMDF33       (*(volatile __near unsigned short *)0x63E)
#define RPGACC95L    (*(volatile __near unsigned char  *)0x63E)
#define TMDF33L      (*(volatile __near unsigned char  *)0x63E)
#define RPGACC95H    (*(volatile __near unsigned char  *)0x63F)
#define TMDF33H      (*(volatile __near unsigned char  *)0x63F)
#define RPGACC96     (*(volatile __near unsigned short *)0x640)
#define RPGACC96L    (*(volatile __near unsigned char  *)0x640)
#define RPGACC96H    (*(volatile __near unsigned char  *)0x641)
#define RPGACC97     (*(volatile __near unsigned short *)0x642)
#define RPGACC97L    (*(volatile __near unsigned char  *)0x642)
#define RPGACC97H    (*(volatile __near unsigned char  *)0x643)
#define RPGACC98     (*(volatile __near unsigned short *)0x644)
#define RPGACC98L    (*(volatile __near unsigned char  *)0x644)
#define RPGACC98H    (*(volatile __near unsigned char  *)0x645)
#define RPGACC99     (*(volatile __near unsigned short *)0x646)
#define RPGACC99L    (*(volatile __near unsigned char  *)0x646)
#define RPGACC99H    (*(volatile __near unsigned char  *)0x647)
#define RPGACC100    (*(volatile __near unsigned short *)0x648)
#define RPGACC100L   (*(volatile __near unsigned char  *)0x648)
#define RPGACC100H   (*(volatile __near unsigned char  *)0x649)
#define RPGACC101    (*(volatile __near unsigned short *)0x64A)
#define RPGACC101L   (*(volatile __near unsigned char  *)0x64A)
#define RPGACC101H   (*(volatile __near unsigned char  *)0x64B)
#define RPGACC102    (*(volatile __near unsigned short *)0x64C)
#define RPGACC102L   (*(volatile __near unsigned char  *)0x64C)
#define RPGACC102H   (*(volatile __near unsigned char  *)0x64D)
#define RPGACC103    (*(volatile __near unsigned short *)0x64E)
#define RPGACC103L   (*(volatile __near unsigned char  *)0x64E)
#define RPGACC103H   (*(volatile __near unsigned char  *)0x64F)
#define RPGACC104    (*(volatile __near unsigned short *)0x650)
#define RPGACC104L   (*(volatile __near unsigned char  *)0x650)
#define RPGACC104H   (*(volatile __near unsigned char  *)0x651)
#define RPGACC105    (*(volatile __near unsigned short *)0x652)
#define RPGACC105L   (*(volatile __near unsigned char  *)0x652)
#define RPGACC105H   (*(volatile __near unsigned char  *)0x653)
#define RPGACC106    (*(volatile __near unsigned short *)0x654)
#define RPGACC106L   (*(volatile __near unsigned char  *)0x654)
#define RPGACC106H   (*(volatile __near unsigned char  *)0x655)
#define RPGACC107    (*(volatile __near unsigned short *)0x656)
#define RPGACC107L   (*(volatile __near unsigned char  *)0x656)
#define RPGACC107H   (*(volatile __near unsigned char  *)0x657)
#define RPGACC108    (*(volatile __near unsigned short *)0x658)
#define RPGACC108L   (*(volatile __near unsigned char  *)0x658)
#define RPGACC108H   (*(volatile __near unsigned char  *)0x659)
#define RPGACC109    (*(volatile __near unsigned short *)0x65A)
#define RPGACC109L   (*(volatile __near unsigned char  *)0x65A)
#define RPGACC109H   (*(volatile __near unsigned char  *)0x65B)
#define RPGACC110    (*(volatile __near unsigned short *)0x65C)
#define RPGACC110L   (*(volatile __near unsigned char  *)0x65C)
#define RPGACC110H   (*(volatile __near unsigned char  *)0x65D)
#define RPGACC111    (*(volatile __near unsigned short *)0x65E)
#define RPGACC111L   (*(volatile __near unsigned char  *)0x65E)
#define RPGACC111H   (*(volatile __near unsigned char  *)0x65F)
#define RPGACC112    (*(volatile __near unsigned short *)0x660)
#define RPGACC112L   (*(volatile __near unsigned char  *)0x660)
#define RPGACC112H   (*(volatile __near unsigned char  *)0x661)
#define RPGACC113    (*(volatile __near unsigned short *)0x662)
#define RPGACC113L   (*(volatile __near unsigned char  *)0x662)
#define RPGACC113H   (*(volatile __near unsigned char  *)0x663)
#define RPGACC114    (*(volatile __near unsigned short *)0x664)
#define RPGACC114L   (*(volatile __near unsigned char  *)0x664)
#define RPGACC114H   (*(volatile __near unsigned char  *)0x665)
#define RPGACC115    (*(volatile __near unsigned short *)0x666)
#define RPGACC115L   (*(volatile __near unsigned char  *)0x666)
#define RPGACC115H   (*(volatile __near unsigned char  *)0x667)
#define RPGACC116    (*(volatile __near unsigned short *)0x668)
#define RPGACC116L   (*(volatile __near unsigned char  *)0x668)
#define RPGACC116H   (*(volatile __near unsigned char  *)0x669)
#define RPGACC117    (*(volatile __near unsigned short *)0x66A)
#define RPGACC117L   (*(volatile __near unsigned char  *)0x66A)
#define RPGACC117H   (*(volatile __near unsigned char  *)0x66B)
#define RPGACC118    (*(volatile __near unsigned short *)0x66C)
#define RPGACC118L   (*(volatile __near unsigned char  *)0x66C)
#define RPGACC118H   (*(volatile __near unsigned char  *)0x66D)
#define RPGACC119    (*(volatile __near unsigned short *)0x66E)
#define RPGACC119L   (*(volatile __near unsigned char  *)0x66E)
#define RPGACC119H   (*(volatile __near unsigned char  *)0x66F)
#define RPGACC120    (*(volatile __near unsigned short *)0x670)
#define RPGACC120L   (*(volatile __near unsigned char  *)0x670)
#define RPGACC120H   (*(volatile __near unsigned char  *)0x671)
#define RPGACC121    (*(volatile __near unsigned short *)0x672)
#define RPGACC121L   (*(volatile __near unsigned char  *)0x672)
#define RPGACC121H   (*(volatile __near unsigned char  *)0x673)
#define RPGACC122    (*(volatile __near unsigned short *)0x674)
#define RPGACC122L   (*(volatile __near unsigned char  *)0x674)
#define RPGACC122H   (*(volatile __near unsigned char  *)0x675)
#define RPGACC123    (*(volatile __near unsigned short *)0x676)
#define RPGACC123L   (*(volatile __near unsigned char  *)0x676)
#define RPGACC123H   (*(volatile __near unsigned char  *)0x677)
#define RPGACC124    (*(volatile __near unsigned short *)0x678)
#define RPGACC124L   (*(volatile __near unsigned char  *)0x678)
#define RPGACC124H   (*(volatile __near unsigned char  *)0x679)
#define RPGACC125    (*(volatile __near unsigned short *)0x67A)
#define RPGACC125L   (*(volatile __near unsigned char  *)0x67A)
#define RPGACC125H   (*(volatile __near unsigned char  *)0x67B)
#define RPGACC126    (*(volatile __near unsigned short *)0x67C)
#define RPGACC126L   (*(volatile __near unsigned char  *)0x67C)
#define RPGACC126H   (*(volatile __near unsigned char  *)0x67D)
#define RPGACC127    (*(volatile __near unsigned short *)0x67E)
#define RPGACC127L   (*(volatile __near unsigned char  *)0x67E)
